In [105]:
# Carregando todas as bibliotecas
import pandas as pd
import numpy as np

In [106]:
#Carregando os dados
#df=pd.read_csv(r'C:\Users\gabri\Downloads\credit_scoring_eng.csv')
try:
    
    df = pd.read_csv('credit_scoring_eng.csv')
except:
    df=pd.read_csv('/datasets/credit_scoring_eng.csv')

In [107]:
#Lendo informações gerais sobre o dataframe.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21525 entries, 0 to 21524
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21525 non-null  int64
 1   days_employed     19351 non-null  float64
 2   dob_years         21525 non-null  int64
 3   education         21525 non-null  object
 4   education_id      21525 non-null  int64
 5   family_status     21525 non-null  object
 6   family_status_id  21525 non-null  int64
 7   gender            21525 non-null  object
 8   income_type       21525 non-null  object
 9   debt              21525 non-null  int64
 10  total_income      19351 non-null  float64
 11  purpose           21525 non-null  object
dtypes: float64(2), int64(5), object(5)
memory usage: 2.0+ MB

**Descrição dos dados**
- `children` - o número de crianças na família
- `days_employed` - experiência de trabalho em dias
- `dob_years` - idade do cliente em anos
- `education` - educação do cliente
- `education_id` - identificador de educação
- `family_status` - estado civil do cliente
- `family_status_id` - identificador de estado civil
- `gender` - gênero do cliente
- `income_type` - tipo de emprego
- `debt` - havia alguma dívida no pagamento do empréstimo
- `total_income` - renda mensal
- `purpose` - o objetivo de obter um empréstimo

In [108]:
# Vamos ver quantas linhas e colunas nosso conjunto de dados tem
df.shape

(21525, 12)

In [109]:
# vamos exibir as primeiras N linhas
df.head(10)

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
0,1,-8437.673028,42,bachelor's degree,0,married,0,F,employee,0,40620.102,purchase of the house
1,1,-4024.803754,36,secondary education,1,married,0,F,employee,0,17932.802,car purchase
2,0,-5623.422610,33,Secondary Education,1,married,0,M,employee,0,23341.752,purchase of the house
3,3,-4124.747207,32,secondary education,1,married,0,M,employee,0,42820.568,supplementary education
4,0,340266.072047,53,secondary education,1,civil partnership,1,F,retiree,0,25378.572,to have a wedding
5,0,-926.185831,27,bachelor's degree,0,civil partnership,1,M,business,0,40922.170,purchase of the house
6,0,-2879.202052,43,bachelor's degree,0,married,0,F,business,0,38484.156,housing transactions
7,0,-152.779569,50,SECONDARY EDUCATION,1,married,0,M,employee,0,21731.829,education
8,2,-6929.865299,35,BACHELOR'S DEGREE,0,civil partnership,1,F,employee,0,15337.093,having a wedding
9,0,-2188.756445,41,secondary education,1,married,0,M,employee,0,23108.150,purchase of the house for my family

In [110]:
# Obter informações sobre dados
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21525 entries, 0 to 21524
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21525 non-null  int64
 1   days_employed     19351 non-null  float64
 2   dob_years         21525 non-null  int64
 3   education         21525 non-null  object
 4   education_id      21525 non-null  int64
 5   family_status     21525 non-null  object
 6   family_status_id  21525 non-null  int64
 7   gender            21525 non-null  object
 8   income_type       21525 non-null  object
 9   debt              21525 non-null  int64
 10  total_income      19351 non-null  float64
 11  purpose           21525 non-null  object
dtypes: float64(2), int64(5), object(5)
memory usage: 2.0+ MB

Existem valores ausentes nas colunas referentes a dias empregados e total recebedio, as duas colunas possuem valores ausentes igualmente. Os dados ausentes provavelmente se devem por algum erro de coleta.

In [111]:
# Vejamos a tabela filtrada com valores ausentes na primeira coluna com dados ausentes
df[df['days_employed'].isna()]

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
12,0,NaN,65,secondary education,1,civil partnership,1,M,retiree,0,NaN,to have a wedding
26,0,NaN,41,secondary education,1,married,0,M,civil servant,0,NaN,education
29,0,NaN,63,secondary education,1,unmarried,4,F,retiree,0,NaN,building a real estate
41,0,NaN,50,secondary education,1,married,0,F,civil servant,0,NaN,second-hand car purchase
55,0,NaN,54,secondary education,1,civil partnership,1,F,retiree,1,NaN,to have a wedding
...,...,...,...,...,...,...,...,...,...,...,...,...
21489,2,NaN,47,Secondary Education,1,married,0,M,business,0,NaN,purchase of a car
21495,1,NaN,50,secondary education,1,civil partnership,1,F,employee,0,NaN,wedding ceremony
21497,0,NaN,48,BACHELOR'S DEGREE,0,married,0,F,business,0,NaN,building a property
21502,1,NaN,42,secondary education,1,married,0,F,employee,0,NaN,building a real estate
21510,2,NaN,28,secondary education,1,married,0,F,employee,0,NaN,car purchase

In [112]:
# Vamos aplicar várias condições para filtrar dados e observar o número de linhas na tabela filtrada.

print((df.loc[df['days_employed'].isna() & df['total_income'].isna()].count()))
print(df['days_employed'].isnull().sum())
print(df['total_income'].isnull().sum())
#Descobrindo o valor de números nulos em cada linha.

children            2174
days_employed          0
dob_years           2174
education           2174
education_id        2174
family_status       2174
family_status_id    2174
gender              2174
income_type         2174
debt                2174
total_income           0
purpose             2174
dtype: int64
2174
2174

**Conclusão intermediária**

Os próximos passos vão se basear na análise dos padrões dos dados nulos, concluindo se são acidentais ou não. Percebe-se que
há uma porcentagem de 11% de valores nulos, então será analisados se possuem um padrão e podem ser usados parâmetros para 
aproximar o resultado, ou se seria mais lógico apenas apagar as linhas.
Observando os dados e procurando entender o motivo de linhas das colunas (total income e days employed) estarem vazias é 
deduzido que são acidentais.
Concluindo que são muitos os dados vazios e sendo eles acidentais, é decidido preenche-los e corrigir os dados incorretos de days_employed, que ou são negativos, ou são exorbitantes.

 Vamos investigar clientes que não possuem dados sobre as características identificadas e a coluna com os valores ausentes

In [113]:
print('Porcentagem de valores ausentes= ', int((df['days_employed'].isnull().sum()/df['days_employed'].count())*100), '%')

Porcentagem de valores ausentes=  11 %

In [114]:
df_no_data=df.loc[df['total_income'].isna()]

In [115]:

print(df_no_data.info())
print()
print(df_no_data['children'].value_counts())
print()
print(df_no_data['days_employed'].value_counts())
print()
print(df_no_data['dob_years'].value_counts())
print()
print(df_no_data['education'].value_counts())
print()
print(df_no_data['education_id'].value_counts())
print()
print(df_no_data['family_status'].value_counts())
print()
print(df_no_data['family_status_id'].value_counts())
print()
print(df_no_data['gender'].value_counts())
print()
print(df_no_data['income_type'].value_counts())
print()
print(df_no_data['debt'].value_counts())
print()
print(df_no_data['total_income'].value_counts())
print()
print(df_no_data['purpose'].value_counts())
#df_nd_cont=pd.DataFrame({'children':[df_no_data['children'].value_counts()], 'days_employed':[df_no_data['days_employed']]})

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2174 entries, 12 to 21510
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          2174 non-null   int64
 1   days_employed     0 non-null      float64
 2   dob_years         2174 non-null   int64
 3   education         2174 non-null   object
 4   education_id      2174 non-null   int64
 5   family_status     2174 non-null   object
 6   family_status_id  2174 non-null   int64
 7   gender            2174 non-null   object
 8   income_type       2174 non-null   object
 9   debt              2174 non-null   int64
 10  total_income      0 non-null      float64
 11  purpose           2174 non-null   object
dtypes: float64(2), int64(5), object(5)
memory usage: 220.8+ KB
None

 0     1439
 1      475
 2      204
 3       36
 20       9
 4        7
-1        3
 5        1
Name: children, dtype: int64

Series([], Name: days_employed, dtype: int64)

34    69
40    66
42    65
31    65
35    64
36    63
47    59
41    59
30    58
28    57
58    56
57    56
54    55
56    54
38    54
52    53
37    53
33    51
39    51
50    51
43    50
45    50
49    50
51    50
29    50
46    48
55    48
48    46
44    44
53    44
60    39
62    38
61    38
32    37
64    37
23    36
27    36
26    35
59    34
63    29
25    23
24    21
65    20
66    20
21    18
22    17
67    16
0     10
68     9
71     5
69     5
20     5
70     3
72     2
19     1
73     1
Name: dob_years, dtype: int64

secondary education    1408
bachelor's degree       496
SECONDARY EDUCATION      67
Secondary Education      65
some college             55
Bachelor's Degree        25
BACHELOR'S DEGREE        23
primary education        19
Some College              7
SOME COLLEGE              7
Primary Education         1
PRIMARY EDUCATION         1
Name: education, dtype: int64

1    1540
0     544
2      69
3      21
Name: education_id, dtype: int64

married              1237
civil partnership     442
unmarried             288
divorced              112
widow / widower        95
Name: family_status, dtype: int64

0    1237
1     442
4     288
3     112
2      95
Name: family_status_id, dtype: int64

F    1484
M     690
Name: gender, dtype: int64

employee         1105
business          508
retiree           413
civil servant     147
entrepreneur        1
Name: income_type, dtype: int64

0    2004
1     170
Name: debt, dtype: int64

Series([], Name: total_income, dtype: int64)

having a wedding                            92
to have a wedding                           81
wedding ceremony                            76
construction of own property                75
housing transactions                        74
buy real estate                             72
purchase of the house for my family         71
transactions with my real estate            71
transactions with commercial real estate    70
housing renovation                          70
buy commercial real estate                  67
buying property for renting out             65
property                                    62
real estate transactions                    61
buy residential real estate                 61
housing                                     60
building a property                         59
cars                                        57
going to university                         56
to become educated                          55
second-hand car purchase                    54
buying my own car                           53
to own a car                                52
purchase of the house                       52
to get a supplementary education            51
getting an education                        50
supplementary education                     48
profile education                           47
purchase of a car                           46
building a real estate                      46
purchase of my own house                    46
car purchase                                43
education                                   42
buying a second-hand car                    42
car                                         41
university education                        40
getting higher education                    36
to buy a car                                30
Name: purpose, dtype: int64

Percebe-se que no geral os dados nulos são de todos os tipos.
As outras colunas dos dados estão proporcionalmente semelhantes a contagem de valores da tabela orginal, logo os dados ausentes
são aleatórios.

**Possíveis motivos para valores ausentes nos dados**

As colunas vazias (dias empregados e total recebido) são essenciais para a análise de crédito. Com a análise dos valores será possível descobrir se há algum padrão dentre os dados vazios.

In [116]:
# Verificar a distribuição em todo o conjunto de dados
print(df.info())

print(df['children'].value_counts())
print()
print(df['days_employed'].value_counts())
print()
print(df['dob_years'].value_counts())
print()
print(df['education'].value_counts())
print()
print(df['education_id'].value_counts())
print()
print(df['family_status'].value_counts())
print()
print(df['family_status_id'].value_counts())
print()
print(df['gender'].value_counts())
print()
print(df['income_type'].value_counts())
print()
print(df['debt'].value_counts())
print()
print(df['total_income'].value_counts())
print()
print(df['purpose'].value_counts())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21525 entries, 0 to 21524
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21525 non-null  int64
 1   days_employed     19351 non-null  float64
 2   dob_years         21525 non-null  int64
 3   education         21525 non-null  object
 4   education_id      21525 non-null  int64
 5   family_status     21525 non-null  object
 6   family_status_id  21525 non-null  int64
 7   gender            21525 non-null  object
 8   income_type       21525 non-null  object
 9   debt              21525 non-null  int64
 10  total_income      19351 non-null  float64
 11  purpose           21525 non-null  object
dtypes: float64(2), int64(5), object(5)
memory usage: 2.0+ MB
None
 0     14149
 1      4818
 2      2055
 3       330
 20       76
-1        47
 4        41
 5         9
Name: children, dtype: int64

-8437.673028      1
-3507.818775      1
 354500.415854    1
-769.717438       1
-3963.590317      1
                 ..
-1099.957609      1
-209.984794       1
 398099.392433    1
-1271.038880      1
-1984.507589      1
Name: days_employed, Length: 19351, dtype: int64

35    617
40    609
41    607
34    603
38    598
42    597
33    581
39    573
31    560
36    555
44    547
29    545
30    540
48    538
37    537
50    514
43    513
32    510
49    508
28    503
45    497
27    493
56    487
52    484
47    480
54    479
46    475
58    461
57    460
53    459
51    448
59    444
55    443
26    408
60    377
25    357
61    355
62    352
63    269
64    265
24    264
23    254
65    194
22    183
66    183
67    167
21    111
0     101
68     99
69     85
70     65
71     58
20     51
72     33
19     14
73      8
74      6
75      1
Name: dob_years, dtype: int64

secondary education    13750
bachelor's degree       4718
SECONDARY EDUCATION      772
Secondary Education      711
some college             668
BACHELOR'S DEGREE        274
Bachelor's Degree        268
primary education        250
Some College              47
SOME COLLEGE              29
PRIMARY EDUCATION         17
Primary Education         15
graduate degree            4
Graduate Degree            1
GRADUATE DEGREE            1
Name: education, dtype: int64

1    15233
0     5260
2      744
3      282
4        6
Name: education_id, dtype: int64

married              12380
civil partnership     4177
unmarried             2813
divorced              1195
widow / widower        960
Name: family_status, dtype: int64

0    12380
1     4177
4     2813
3     1195
2      960
Name: family_status_id, dtype: int64

F      14236
M       7288
XNA        1
Name: gender, dtype: int64

employee                       11119
business                        5085
retiree                         3856
civil servant                   1459
unemployed                         2
entrepreneur                       2
student                            1
paternity / maternity leave        1
Name: income_type, dtype: int64

0    19784
1     1741
Name: debt, dtype: int64

17312.717    2
42413.096    2
31791.384    2
21005.772    1
18591.443    1
            ..
27020.895    1
23686.835    1
9606.294     1
28156.762    1
13127.587    1
Name: total_income, Length: 19348, dtype: int64

wedding ceremony                            797
having a wedding                            777
to have a wedding                           774
real estate transactions                    676
buy commercial real estate                  664
buying property for renting out             653
housing transactions                        653
transactions with commercial real estate    651
purchase of the house                       647
housing                                     647
purchase of the house for my family         641
construction of own property                635
property                                    634
transactions with my real estate            630
building a real estate                      626
buy real estate                             624
building a property                         620
purchase of my own house                    620
housing renovation                          612
buy residential real estate                 607
buying my own car                           505
going to university                         496
car                                         495
second-hand car purchase                    489
to own a car                                480
buying a second-hand car                    479
cars                                        478
to buy a car                                472
supplementary education                     462
car purchase                                462
purchase of a car                           455
university education                        453
education                                   447
to get a supplementary education            447
getting an education                        443
profile education                           436
getting higher education                    426
to become educated                          412
Name: purpose, dtype: int64

Os valores podem estar ausentes por algum erro de coleta, pois são aleatórios e não possuem padrão de ausência baseando-se nos outros parâmetros coletados.

**Conclusão intermediária**

A distribuição no conjunto de dados original é semelhante a da tabela filtrada. Isso significa que os dados nulos são 
acidentais, pois não seguem um padrão. É possível procurar esses padrões procurando valores que costumam aparecer nas linhas com dados ausentes, utilizando value_counts.

In [117]:
# Verificando outros motivos e padrões que possam levar a valores ausentes
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21525 entries, 0 to 21524
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21525 non-null  int64
 1   days_employed     19351 non-null  float64
 2   dob_years         21525 non-null  int64
 3   education         21525 non-null  object
 4   education_id      21525 non-null  int64
 5   family_status     21525 non-null  object
 6   family_status_id  21525 non-null  int64
 7   gender            21525 non-null  object
 8   income_type       21525 non-null  object
 9   debt              21525 non-null  int64
 10  total_income      19351 non-null  float64
 11  purpose           21525 non-null  object
dtypes: float64(2), int64(5), object(5)
memory usage: 2.0+ MB

In [118]:
df.groupby('income_type')['total_income'].count()

income_type
business                        4577
civil servant                   1312
employee                       10014
entrepreneur                       1
paternity / maternity leave        1
retiree                         3443
student                            1
unemployed                         2
Name: total_income, dtype: int64

**Conclusão intermediária**

A mesma linha nula da renda mensal também é a de dias empregados, mas todos os outros dados estão completos, incluindo tipo de fonte de renda, nos levando a acreditar que os dados faltantes são realmente acidentais.

**Conclusões**

Os valores ausentes de total_income foram abordados sendo apagados, já que possuem os outros parâmetros completos, há uma forma de preenche-los como lógica, sendo que baseados nos parâmetros oferecidos, podemos usar idade ou tipo de renda para completar a renda mensal.

## Transformação de dados

In [119]:
# Vamos ver todos os valores na coluna de educação para verificar se e quais grafias precisarão ser corrigidas
df['education'].unique()

array(["bachelor's degree", 'secondary education', 'Secondary Education',
       'SECONDARY EDUCATION', "BACHELOR'S DEGREE", 'some college',
       'primary education', "Bachelor's Degree", 'SOME COLLEGE',
       'Some College', 'PRIMARY EDUCATION', 'Primary Education',
       'Graduate Degree', 'GRADUATE DEGREE', 'graduate degree'],
      dtype=object)

In [120]:
df['education']=df['education'].str.lower()

In [121]:
# Verificando todos os valores na coluna para ter certeza de que os corrigimos
df['education'].unique()

array(["bachelor's degree", 'secondary education', 'some college',
       'primary education', 'graduate degree'], dtype=object)

In [122]:
# Vamos ver a distribuição de valores na coluna `children`
df['children'].value_counts()

 0     14149
 1      4818
 2      2055
 3       330
 20       76
-1        47
 4        41
 5         9
Name: children, dtype: int64

Calculando quantidade de dados incorretos

In [123]:
df_incorrects=df[df['children']<0]

In [124]:
df_incorrects=df[df['children']>5]

In [125]:
print(df_incorrects['children'].count())

76

In [126]:
def corrigir_duplicatas(errado, certo):
    df['children']=df['children'].replace(errado, certo)

In [127]:
corrigir_duplicatas(20, 2)

In [128]:
corrigir_duplicatas(-1, -1)

In [129]:
df['children']=df['children'].replace(-1, 1)

A quantidade é irrisória, mas é possível tentar alocar os dados, um exemplo seria considerar 20 como um 2, e um 0 escapulido.
Ou considerar o -1 como um 1 que por algum acaso recebeu um sinal de menos após.

In [130]:
# Verificar a coluna `children` novamente para ter certeza de que está tudo corrigido

df['children'].value_counts()

0    14149
1     4865
2     2131
3      330
4       41
5        9
Name: children, dtype: int64

In [131]:
# Encontrando os dados problemáticos em `days_employed`.
df.loc[(df['days_employed']>10000) & (df['income_type']=='retiree')]

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
4,0,340266.072047,53,secondary education,1,civil partnership,1,F,retiree,0,25378.572,to have a wedding
18,0,400281.136913,53,secondary education,1,widow / widower,2,F,retiree,0,9091.804,buying a second-hand car
24,1,338551.952911,57,secondary education,1,unmarried,4,F,retiree,0,46487.558,transactions with commercial real estate
25,0,363548.489348,67,secondary education,1,married,0,M,retiree,0,8818.041,buy real estate
30,1,335581.668515,62,secondary education,1,married,0,F,retiree,0,27432.971,transactions with commercial real estate
...,...,...,...,...,...,...,...,...,...,...,...,...
21505,0,338904.866406,53,secondary education,1,civil partnership,1,M,retiree,0,12070.399,to have a wedding
21508,0,386497.714078,62,secondary education,1,married,0,M,retiree,0,11622.175,property
21509,0,362161.054124,59,bachelor's degree,0,married,0,M,retiree,0,11684.650,real estate transactions
21518,0,373995.710838,59,secondary education,1,married,0,F,retiree,0,24618.344,purchase of a car
21521,0,343937.404131,67,secondary education,1,married,0,F,retiree,0,24959.969,purchase of a car

In [132]:
((df.loc[(df['days_employed']>100000)])).value_counts('income_type')

income_type
retiree       3443
unemployed       2
dtype: int64

In [133]:
df['income_type'].unique()

array(['employee', 'retiree', 'business', 'civil servant', 'unemployed',
       'entrepreneur', 'student', 'paternity / maternity leave'],
      dtype=object)

In [134]:
df_incorrects['days_employed'].max()

385267.2636757046

In [135]:
df['days_employed']=df['days_employed'].abs()
#Consertando os dados negativos.

In [136]:
(df['days_employed']>20000).sum()

3445

In [137]:
df_no_data_days=df[df['days_employed']<20000]
df_no_data_days

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
0,1,8437.673028,42,bachelor's degree,0,married,0,F,employee,0,40620.102,purchase of the house
1,1,4024.803754,36,secondary education,1,married,0,F,employee,0,17932.802,car purchase
2,0,5623.422610,33,secondary education,1,married,0,M,employee,0,23341.752,purchase of the house
3,3,4124.747207,32,secondary education,1,married,0,M,employee,0,42820.568,supplementary education
5,0,926.185831,27,bachelor's degree,0,civil partnership,1,M,business,0,40922.170,purchase of the house
...,...,...,...,...,...,...,...,...,...,...,...,...
21519,1,2351.431934,37,graduate degree,4,divorced,3,M,employee,0,18551.846,buy commercial real estate
21520,1,4529.316663,43,secondary education,1,civil partnership,1,F,business,0,35966.698,housing transactions
21522,1,2113.346888,38,secondary education,1,civil partnership,1,M,employee,1,14347.610,property
21523,3,3112.481705,38,secondary education,1,married,0,M,employee,1,39054.888,buying my own car
21524,2,1984.507589,40,secondary education,1,married,0,F,employee,0,13127.587,to buy a car

In [138]:
median_days=df_no_data_days['days_employed'].median()

Calculando a mediana geral dos dias empregados para preencher nos valores nulos da tabela.

Procurando valores absurdos em dias empregados.

In [139]:
(df.loc[(df['days_employed']>20000) & (df['income_type']=='retiree'), 'days_employed'])=9000 
#Definindo dias trabalhados dos aposentados para média dos Estados Unidos de trabalho até aposentadoria.

In [140]:
(df.loc[(df['days_employed']>20000), 'days_employed'])=median_days
#Definindo dias trabalhados do restante para mediana geral da tabela.

In [141]:
# Verificando o resultado - certificando de que está corrigido
df['days_employed'].describe()

count    19351.000000
mean      3535.596685
std       3290.476025
min         24.141633
25%        927.009265
50%       2194.207271
75%       5534.630567
max      18388.949901
Name: days_employed, dtype: float64

In [142]:
df.head()

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
0,1,8437.673028,42,bachelor's degree,0,married,0,F,employee,0,40620.102,purchase of the house
1,1,4024.803754,36,secondary education,1,married,0,F,employee,0,17932.802,car purchase
2,0,5623.422610,33,secondary education,1,married,0,M,employee,0,23341.752,purchase of the house
3,3,4124.747207,32,secondary education,1,married,0,M,employee,0,42820.568,supplementary education
4,0,9000.000000,53,secondary education,1,civil partnership,1,F,retiree,0,25378.572,to have a wedding

In [143]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21525 entries, 0 to 21524
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21525 non-null  int64
 1   days_employed     19351 non-null  float64
 2   dob_years         21525 non-null  int64
 3   education         21525 non-null  object
 4   education_id      21525 non-null  int64
 5   family_status     21525 non-null  object
 6   family_status_id  21525 non-null  int64
 7   gender            21525 non-null  object
 8   income_type       21525 non-null  object
 9   debt              21525 non-null  int64
 10  total_income      19351 non-null  float64
 11  purpose           21525 non-null  object
dtypes: float64(2), int64(5), object(5)
memory usage: 2.0+ MB

In [144]:
# Verificando o `dob_years` para valores suspeitos e contando a porcentagem
display(df.sort_values(by='dob_years', ascending=False))
#Analisando dados de usuários, dos mais belhos aos mais novos.
display(df[df['dob_years']<19])
#Analisando dados de usuários mais novos.

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
8880,0,1678.969771,75,secondary education,1,widow / widower,2,F,civil servant,0,24525.224,to become educated
4895,0,9000.000000,74,bachelor's degree,0,married,0,F,retiree,0,21589.657,purchase of my own house
2557,0,9000.000000,74,secondary education,1,married,0,F,retiree,0,6868.368,cars
3460,0,9000.000000,74,secondary education,1,married,0,M,retiree,0,8760.759,transactions with my real estate
12317,0,1729.632531,74,secondary education,1,married,0,M,business,0,19972.813,buy residential real estate
...,...,...,...,...,...,...,...,...,...,...,...,...
578,0,9000.000000,0,secondary education,1,married,0,F,retiree,0,15619.310,construction of own property
8672,0,2442.763520,0,secondary education,1,unmarried,4,M,employee,0,34707.758,second-hand car purchase
2469,0,794.876230,0,secondary education,1,civil partnership,1,F,employee,0,15354.832,to have a wedding
1890,0,NaN,0,bachelor's degree,0,unmarried,4,F,employee,0,NaN,housing
14514,0,9000.000000,0,secondary education,1,widow / widower,2,F,retiree,0,13954.466,going to university

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
99,0,9000.000000,0,secondary education,1,married,0,F,retiree,0,11406.644,car
149,0,2664.273168,0,secondary education,1,divorced,3,F,employee,0,11228.230,housing transactions
270,3,1872.663186,0,secondary education,1,married,0,F,employee,0,16346.633,housing renovation
578,0,9000.000000,0,secondary education,1,married,0,F,retiree,0,15619.310,construction of own property
1040,0,1158.029561,0,bachelor's degree,0,divorced,3,F,business,0,48639.062,to own a car
...,...,...,...,...,...,...,...,...,...,...,...,...
19829,0,NaN,0,secondary education,1,married,0,F,employee,0,NaN,housing
20462,0,9000.000000,0,secondary education,1,married,0,F,retiree,0,41471.027,purchase of my own house
20577,0,9000.000000,0,secondary education,1,unmarried,4,F,retiree,0,20766.202,property
21179,2,108.967042,0,bachelor's degree,0,married,0,M,business,0,38512.321,building a real estate
21313,0,1268.487728,0,secondary education,1,unmarried,4,M,employee,0,24387.070,housing transactions

In [145]:
df['dob_years'].value_counts(normalize=True)

35    0.028664
40    0.028293
41    0.028200
34    0.028014
38    0.027782
42    0.027735
33    0.026992
39    0.026620
31    0.026016
36    0.025784
44    0.025412
29    0.025319
30    0.025087
48    0.024994
37    0.024948
50    0.023879
43    0.023833
32    0.023693
49    0.023600
28    0.023368
45    0.023089
27    0.022904
56    0.022625
52    0.022485
47    0.022300
54    0.022253
46    0.022067
58    0.021417
57    0.021370
53    0.021324
51    0.020813
59    0.020627
55    0.020581
26    0.018955
60    0.017515
25    0.016585
61    0.016492
62    0.016353
63    0.012497
64    0.012311
24    0.012265
23    0.011800
65    0.009013
22    0.008502
66    0.008502
67    0.007758
21    0.005157
0     0.004692
68    0.004599
69    0.003949
70    0.003020
71    0.002695
20    0.002369
72    0.001533
19    0.000650
73    0.000372
74    0.000279
75    0.000046
Name: dob_years, dtype: float64

Preenchendo as idades vazias.

In [146]:
(df.loc[(df['dob_years']==0) & (df['income_type']=='retiree'), 'dob_years'])=70 
#Definindo a idade dos aposentados com uma estimativa de 70

Definindo tabela dinâmica para calcular a mediana de anos baseado no nível de educação do indivíduo.

In [147]:
data_pivot=df_no_data.pivot_table(index=['education'], values='dob_years', aggfunc='median')

In [148]:
def fill_years(row):
    if pd.isna(row['dob_years']):
        return data_pivot['dob_years'][row['education']]
    elif row['dob_years']==0:
        return data_pivot['dob_years'][row['education']]
    return row['dob_years']

In [149]:
df['dob_years'] = df.apply(fill_years, axis=1)

In [150]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21525 entries, 0 to 21524
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21525 non-null  int64
 1   days_employed     19351 non-null  float64
 2   dob_years         21525 non-null  int64
 3   education         21525 non-null  object
 4   education_id      21525 non-null  int64
 5   family_status     21525 non-null  object
 6   family_status_id  21525 non-null  int64
 7   gender            21525 non-null  object
 8   income_type       21525 non-null  object
 9   debt              21525 non-null  int64
 10  total_income      19351 non-null  float64
 11  purpose           21525 non-null  object
dtypes: float64(2), int64(5), object(5)
memory usage: 2.0+ MB

In [151]:
# Verificando o resultado - certificando de que está corrigido
df['dob_years'].value_counts().sort_values()

75      1
74      6
73      8
19     14
72     33
20     51
71     58
69     85
70     85
68     99
21    111
67    167
22    183
66    183
65    194
23    254
24    264
64    265
63    269
62    352
61    355
25    357
60    377
26    408
55    443
59    444
51    448
53    459
57    460
58    461
46    475
54    479
47    480
52    484
56    487
27    493
45    497
28    503
49    508
32    510
43    513
50    514
37    537
48    538
30    540
29    545
36    555
31    560
33    581
44    597
42    597
38    598
39    602
34    603
41    607
40    609
35    619
Name: dob_years, dtype: int64

In [152]:
# Vamos ver os valores da coluna

df['family_status'].unique()

array(['married', 'civil partnership', 'widow / widower', 'divorced',
       'unmarried'], dtype=object)

In [153]:
df['family_status'].value_counts()

married              12380
civil partnership     4177
unmarried             2813
divorced              1195
widow / widower        960
Name: family_status, dtype: int64

In [154]:
df['family_status'].isnull().sum()

0

In [155]:
(df['dob_years']==0).sum()
#Verificando dados

0

In [156]:
df['family_status'].unique()

array(['married', 'civil partnership', 'widow / widower', 'divorced',
       'unmarried'], dtype=object)

In [157]:
# Verificando o resultado - certificando de que está corrigido

In [158]:
# Vamos ver os valores na coluna
df['gender'].value_counts()

F      14236
M       7288
XNA        1
Name: gender, dtype: int64

In [159]:
print(df.loc[(df['gender']=='XNA')])

       children  days_employed  dob_years     education  education_id  \
10701         0    2358.600502         24  some college             2

           family_status  family_status_id gender income_type  debt  \
10701  civil partnership                 1    XNA    business     0

       total_income          purpose
10701     32624.825  buy real estate

In [160]:
#Apagando linha outlier da tabela.
(df.drop(df[df['gender']=='XNA'].index, inplace=True))

In [161]:
# Verificando o resultado - certificando de que está corrigido
display(df.loc[(df['gender']=='XNA')])

Empty DataFrame
Columns: [children, days_employed, dob_years, education, education_id, family_status, family_status_id, gender, income_type, debt, total_income, purpose]
Index: []

In [162]:
# Vamos ver os valores na coluna
print(df['income_type'].unique())

['employee' 'retiree' 'business' 'civil servant' 'unemployed'
 'entrepreneur' 'student' 'paternity / maternity leave']

In [163]:
# Verificar duplicatas
print(df.duplicated().sum())

71

In [164]:
# Abordando as duplicatas
df=df.drop_duplicates().reset_index(drop=True)

In [165]:
# Última verificação se temos duplicatas
print(df.duplicated().sum())

0

Os dados duplicados foram apagados pelo fato que os dias empregados estão em float, como valores bem específicos. Logo, na prática seria impossível que existam duas pessoas diferentes com a quantidade exata de tempo empregadas iguais.
Os valores nulos também foram apagados, fazendo assim o primeiro processo do ciclo crisp de tratamento de dados.

In [166]:
#Verificando o tamanho do conjunto de dados que você tem agora após suas primeiras manipulações com ele
df.shape

(21453, 12)

# Trabalhando com valores ausentes

In [167]:
def age_category(row):
    if row['dob_years'] <35:
        return 'jovem'
    elif row['dob_years'] <51:
        return 'adultos'
    elif row['dob_years'] <76:
        return 'idosos'

### Restaurar valores ausentes em `total_income`

Serão utilizados como parâmetros para calcular renda mensal a idade, nível de escolaridade e tipo de renda. Será utilizada a mediana ao invés da média para fugir dos valores exorbitantes.

In [168]:
# Vamos aplicar função que calcule a categoria de idade

df['age_group'] = df.apply(age_category, axis=1)

In [169]:
print(df['total_income'].isna().sum())

2103

Conferindo se há algum valor igual a zero.

In [170]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21453 entries, 0 to 21452
Data columns (total 13 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21453 non-null  int64
 1   days_employed     19350 non-null  float64
 2   dob_years         21453 non-null  int64
 3   education         21453 non-null  object
 4   education_id      21453 non-null  int64
 5   family_status     21453 non-null  object
 6   family_status_id  21453 non-null  int64
 7   gender            21453 non-null  object
 8   income_type       21453 non-null  object
 9   debt              21453 non-null  int64
 10  total_income      19350 non-null  float64
 11  purpose           21453 non-null  object
 12  age_group         21453 non-null  object
dtypes: float64(2), int64(5), object(6)
memory usage: 2.1+ MB

In [171]:
# Crie uma tabela sem valores ausentes e exiba algumas de suas linhas para garantir que ela fique boa
df_no_na=df.dropna()
print(df_no_na.info())

<class 'pandas.core.frame.DataFrame'>
Int64Index: 19350 entries, 0 to 21452
Data columns (total 13 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          19350 non-null  int64
 1   days_employed     19350 non-null  float64
 2   dob_years         19350 non-null  int64
 3   education         19350 non-null  object
 4   education_id      19350 non-null  int64
 5   family_status     19350 non-null  object
 6   family_status_id  19350 non-null  int64
 7   gender            19350 non-null  object
 8   income_type       19350 non-null  object
 9   debt              19350 non-null  int64
 10  total_income      19350 non-null  float64
 11  purpose           19350 non-null  object
 12  age_group         19350 non-null  object
dtypes: float64(2), int64(5), object(6)
memory usage: 2.1+ MB
None

df_no_na.info()

In [172]:
# Veja os valores da mediana de renda com base em seus fatores identificados

#Calculando a renda de acordo com a mediana da educação e faixa etária.
data_pivot=df_no_na.pivot_table(index=['education', 'age_group'], values='total_income', aggfunc='median')

In [173]:
data_pivot

                               total_income
education           age_group
bachelor's degree   adultos      29836.0240
                    idosos       26908.0530
                    jovem        27044.4440
graduate degree     adultos      18551.8460
                    idosos       40868.0310
primary education   adultos      20620.1185
                    idosos       17026.0580
                    jovem        20705.8340
secondary education adultos      22955.2420
                    idosos       20295.9270
                    jovem        21924.1310
some college        adultos      29825.7040
                    idosos       25303.3440
                    jovem        23660.6785

In [174]:
print(df['total_income'].isna().sum())

2103

In [175]:
print(df['total_income'])

0        40620.102
1        17932.802
2        23341.752
3        42820.568
4        25378.572
           ...
21448    35966.698
21449    24959.969
21450    14347.610
21451    39054.888
21452    13127.587
Name: total_income, Length: 21453, dtype: float64

In [176]:
#  Escreva uma função que usaremos para preencher os valores ausentes
def fill_total_income(row):
    if pd.isna(row['total_income']):
        return data_pivot['total_income'][row['education']][row['age_group']]
    return row['total_income']

In [177]:
df['total_income'] = df.apply(fill_total_income, axis=1)

In [178]:
# Verificando se temos algum erro
df.info()
#Há 84 linhas de código nulas em dob_years.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21453 entries, 0 to 21452
Data columns (total 13 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21453 non-null  int64
 1   days_employed     19350 non-null  float64
 2   dob_years         21453 non-null  int64
 3   education         21453 non-null  object
 4   education_id      21453 non-null  int64
 5   family_status     21453 non-null  object
 6   family_status_id  21453 non-null  int64
 7   gender            21453 non-null  object
 8   income_type       21453 non-null  object
 9   debt              21453 non-null  int64
 10  total_income      21453 non-null  float64
 11  purpose           21453 non-null  object
 12  age_group         21453 non-null  object
dtypes: float64(2), int64(5), object(6)
memory usage: 2.1+ MB

In [179]:
# Substituir valores ausentes se houver algum erro

In [180]:
# Verificar o número de entradas nas colunas
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21453 entries, 0 to 21452
Data columns (total 13 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21453 non-null  int64
 1   days_employed     19350 non-null  float64
 2   dob_years         21453 non-null  int64
 3   education         21453 non-null  object
 4   education_id      21453 non-null  int64
 5   family_status     21453 non-null  object
 6   family_status_id  21453 non-null  int64
 7   gender            21453 non-null  object
 8   income_type       21453 non-null  object
 9   debt              21453 non-null  int64
 10  total_income      21453 non-null  float64
 11  purpose           21453 non-null  object
 12  age_group         21453 non-null  object
dtypes: float64(2), int64(5), object(6)
memory usage: 2.1+ MB

###  Restaurar valores em `days_employed`

Valores ausentes já excluídos, não há como restaurar os valores.

In [181]:
# Distribuição dos valores da mediana de `days_employed` com base em seus parâmetros identificados
#Tabela dinâmica refente a classificação de dados com parâmetro de idade.
data_pivot_days=df_no_na.pivot_table(index=['education', 'age_group'], values='days_employed', aggfunc='median')

In [182]:
df['days_employed'].head()

0    8437.673028
1    4024.803754
2    5623.422610
3    4124.747207
4    9000.000000
Name: days_employed, dtype: float64

In [183]:
# Verificando se a função funciona

print(data_pivot_days)

                               days_employed
education           age_group
bachelor's degree   adultos      2011.649143
                    idosos       8109.413353
                    jovem        1185.628632
graduate degree     adultos      2351.431934
                    idosos       9000.000000
primary education   adultos      1103.077099
                    idosos       9000.000000
                    jovem        1149.039829
secondary education adultos      2030.362978
                    idosos       9000.000000
                    jovem        1213.391116
some college        adultos      1545.885182
                    idosos       5416.326845
                    jovem         936.935059

In [184]:
# Vamos escrever uma função que calcule médias ou medianas (dependendo da sua decisão) com base no seu parâmetro identificado
def fill_days_employed(row):
    if pd.isna(row['days_employed']):
        return data_pivot_days['days_employed'][row['education']][row['age_group']]
    return row['days_employed']

In [185]:
# Aplicar função
df['days_employed']=df.apply(fill_days_employed, axis=1)

In [186]:
# Verificando se a função funcionou
print(df['days_employed'].isna().sum())

0

In [187]:
# Verificando as entradas em todas as colunas - certificando de corrigir todos os valores ausentes
df.count()

children            21453
days_employed       21453
dob_years           21453
education           21453
education_id        21453
family_status       21453
family_status_id    21453
gender              21453
income_type         21453
debt                21453
total_income        21453
purpose             21453
age_group           21453
dtype: int64

In [188]:
# Exiba os valores dos dados selecionados para categorização
df['purpose'].value_counts()

wedding ceremony                            791
having a wedding                            768
to have a wedding                           765
real estate transactions                    675
buy commercial real estate                  661
housing transactions                        652
buying property for renting out             651
transactions with commercial real estate    650
purchase of the house                       646
housing                                     646
purchase of the house for my family         638
construction of own property                635
property                                    633
transactions with my real estate            627
building a real estate                      624
buy real estate                             620
purchase of my own house                    620
building a property                         619
housing renovation                          607
buy residential real estate                 606
buying my own car                           505
going to university                         496
car                                         494
second-hand car purchase                    486
to own a car                                478
buying a second-hand car                    478
cars                                        478
to buy a car                                471
car purchase                                461
supplementary education                     460
purchase of a car                           455
university education                        452
education                                   447
to get a supplementary education            446
getting an education                        442
profile education                           436
getting higher education                    426
to become educated                          408
Name: purpose, dtype: int64

In [189]:
# Verificando os valores exclusivos
df['purpose'].unique()

array(['purchase of the house', 'car purchase', 'supplementary education',
       'to have a wedding', 'housing transactions', 'education',
       'having a wedding', 'purchase of the house for my family',
       'buy real estate', 'buy commercial real estate',
       'buy residential real estate', 'construction of own property',
       'property', 'building a property', 'buying a second-hand car',
       'buying my own car', 'transactions with commercial real estate',
       'building a real estate', 'housing',
       'transactions with my real estate', 'cars', 'to become educated',
       'second-hand car purchase', 'getting an education', 'car',
       'wedding ceremony', 'to get a supplementary education',
       'purchase of my own house', 'real estate transactions',
       'getting higher education', 'to own a car', 'purchase of a car',
       'profile education', 'university education',
       'buying property for renting out', 'to buy a car',
       'housing renovation', 'going to university'], dtype=object)

In [190]:
df.head()

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose,age_group
0,1,8437.673028,42,bachelor's degree,0,married,0,F,employee,0,40620.102,purchase of the house,adultos
1,1,4024.803754,36,secondary education,1,married,0,F,employee,0,17932.802,car purchase,adultos
2,0,5623.422610,33,secondary education,1,married,0,M,employee,0,23341.752,purchase of the house,jovem
3,3,4124.747207,32,secondary education,1,married,0,M,employee,0,42820.568,supplementary education,jovem
4,0,9000.000000,53,secondary education,1,civil partnership,1,F,retiree,0,25378.572,to have a wedding,idosos

In [191]:
# Vamos escrever uma função para categorizar os dados com base em tópicos comunss
#17:29
def proposito(row):
    if 'hous' in row['purpose'] or 'prop' in row['purpose'] or 'real est' in row['purpose']:
        return 'real estate'
    if 'car' in row ['purpose']:
        return 'car'
    if 'educ' in row['purpose'] or 'university' in row['purpose']:
        return 'education'
    if 'wedd' in row['purpose']:
        return 'wedding'

In [192]:
# Criando uma coluna com as categorias e contando os valores para elas

df['type_of_purpose']=df.apply(proposito, axis=1)

In [193]:
df[df['type_of_purpose'].isna()]
#Checando se tudo está correto.

Empty DataFrame
Columns: [children, days_employed, dob_years, education, education_id, family_status, family_status_id, gender, income_type, debt, total_income, purpose, age_group, type_of_purpose]
Index: []

In [194]:
# Examinar todos os dados numéricos em sua coluna selecionada para categorização
df['total_income']

0        40620.102
1        17932.802
2        23341.752
3        42820.568
4        25378.572
           ...
21448    35966.698
21449    24959.969
21450    14347.610
21451    39054.888
21452    13127.587
Name: total_income, Length: 21453, dtype: float64

In [195]:
# Obter estatísticas resumidas para a coluna
df['total_income'].describe()

count     21453.000000
mean      26465.581902
std       15708.661472
min        3306.762000
25%       17191.455000
50%       22955.242000
75%       31327.922000
max      362496.645000
Name: total_income, dtype: float64

In [196]:
df.head()

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose,age_group,type_of_purpose
0,1,8437.673028,42,bachelor's degree,0,married,0,F,employee,0,40620.102,purchase of the house,adultos,real estate
1,1,4024.803754,36,secondary education,1,married,0,F,employee,0,17932.802,car purchase,adultos,car
2,0,5623.422610,33,secondary education,1,married,0,M,employee,0,23341.752,purchase of the house,jovem,real estate
3,3,4124.747207,32,secondary education,1,married,0,M,employee,0,42820.568,supplementary education,jovem,education
4,0,9000.000000,53,secondary education,1,civil partnership,1,F,retiree,0,25378.572,to have a wedding,idosos,wedding

In [197]:
# Criar função para categorização em diferentes grupos numéricos com base em intervalos
def economic_class(valor):
    if valor<=17191:
        valor = 'economic_class'
        
    elif valor<=22960:
        valor = 'executive_class'
        
    elif valor<=31327:
        valor = 'first_class'
        
    else:
        valor = 'five_star_class'
        
    return valor

In [198]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21453 entries, 0 to 21452
Data columns (total 14 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21453 non-null  int64
 1   days_employed     21453 non-null  float64
 2   dob_years         21453 non-null  int64
 3   education         21453 non-null  object
 4   education_id      21453 non-null  int64
 5   family_status     21453 non-null  object
 6   family_status_id  21453 non-null  int64
 7   gender            21453 non-null  object
 8   income_type       21453 non-null  object
 9   debt              21453 non-null  int64
 10  total_income      21453 non-null  float64
 11  purpose           21453 non-null  object
 12  age_group         21453 non-null  object
 13  type_of_purpose   21453 non-null  object
dtypes: float64(2), int64(5), object(7)
memory usage: 2.3+ MB

In [199]:
# Criar coluna com categorias
df['class'] = df['total_income'].apply(economic_class)

## Verificar as Hipóteses

In [200]:
# Contando os valores de cada categoria para ver a distribuição
pivot_table_children = df.pivot_table(index='children', columns= 'debt', values='days_employed', aggfunc='count')

In [201]:
pivot_table_children['percent_1'] = pivot_table_children[1] / (pivot_table_children[1] + pivot_table_children[0]) * 100
pivot_table_children.sort_values(by='percent_1', ascending=True)

debt            0       1  percent_1
children
0         13027.0  1063.0   7.544358
3           303.0    27.0   8.181818
1          4410.0   445.0   9.165808
2          1926.0   202.0   9.492481
4            37.0     4.0   9.756098
5             9.0     NaN        NaN

Utilizando uma tabela dinâmica para calcular a porcentagem de acordo com a parcela de pessoas com determinadas quantidades de filhos que possuem débitos.
As seguintes hipóteses também vão ser geradas com esse método.

Pessoas com 5 filhos não possuem débitos (Talvez pela amostra pequena), enquanto pessoas sem filhos tendem a possuir menos que as demais.

**Existe uma correlação entre o nível de renda e do pagamento em dia?**

Utilizando uma tabela dinâmica para calcular a porcentagem de acordo com a parcela de pessoas com determinadas quantidades de filhos que possuem débitos.

In [202]:
# Contando os valores de cada categoria para ver a distribuição
pivot_table_class = df.pivot_table(index='class', columns= 'debt', values='days_employed', aggfunc='count')

In [203]:
pivot_table_class['percent_1'] = pivot_table_class[1] / (pivot_table_class[1] + pivot_table_class[0]) * 100
pivot_table_class.sort_values(by='percent_1', ascending=True)

debt                0    1  percent_1
class
five_star_class  4981  383   7.140194
economic_class   4936  427   7.961962
first_class      4665  427   8.385703
executive_class  5130  504   8.945687

**Conclusão**

Classes altas e baixas tendem ligeiramente a possuir menos dívidas, enquanto a classe média possui uma maior quantidade.

**Existe uma correlação entre o status familiar e o pagamento em dia?**

In [204]:
# Contando os valores de cada categoria para ver a distribuição
pivot_table_family = df.pivot_table(index='family_status', columns= 'debt', values='days_employed', aggfunc='count')

In [205]:
pivot_table_family['percent_1'] = pivot_table_family[1] / (pivot_table_family[1] + pivot_table_family[0]) * 100
pivot_table_family.sort_values(by='percent_1', ascending=True)

debt                   0    1  percent_1
family_status
widow / widower      896   63   6.569343
divorced            1110   85   7.112971
married            11408  931   7.545182
civil partnership   3762  388   9.349398
unmarried           2536  274   9.750890

**Conclusão**

Parcerias civis e 'unmarried' tendem a possuir uma maior quantidade de dívidas, enquanto viúvos tendem a não possuir.

**Como a finalidade do crédito afeta a taxa de inadimplência?**

In [206]:
# Contando os valores de cada categoria para ver a distribuição
pivot_table_debt = df.pivot_table(index='type_of_purpose', columns= 'debt', values='days_employed', aggfunc='count')

In [207]:
pivot_table_debt['percent_1'] = pivot_table_debt[1] / (pivot_table_debt[1] + pivot_table_debt[0]) * 100
pivot_table_debt.sort_values(by='percent_1', ascending=True)

debt                 0    1  percent_1
type_of_purpose
real estate      10028  782   7.234043
wedding           2138  186   8.003442
education         3643  370   9.220035
car               3903  403   9.359034

**Conclusão**

Tendem a tomar débitos pessos com finalidade de investimento em educação e carros.

**Conclusão**

 Conclusão Geral 
 Para o caso foram ajustados os nomes das colunas para um padrão a fim de facilitar o cálculo da mediana de alguns aspectos.
 Tais dados foram tratados, dias: negativos e valores exorbitantes, filhos: com números negativos ou exorbitantes, gênero: um desconhecido, nível escolar: nomes padronizados.
 Outros dados foram agrupados com objetivo de categorizá-los e facilitar para preencher os dados das linhas vazias. Pela renda classifiquei a classe, e pelos objetivos do empréstimo foram criadas categorias para o tipo de investimento destinado ao empréstimo.
 Depois de formatar a tabela e analisar os dados é concluível que: 
 Real estate e wedding possuem uma porcentagem menor de inadiplência a empréstimos feitos com a finalidade envolvendo educação e carros.
 Viúvos, casados e divorciados tendem a ter menos dívidas.
 Pessoas com 5 filhos não possuem débitos (talvez por uma amostra pequena), enquanto pessoas sem filhos tendem a possuir menos que as demais.